styling docs working! Time to reduce though it is too much
